# Recomendation System Using Machine Learing 

### **Logistic Regression**


### **Import the Libraries**

In [174]:
import pandas as pd
import numpy as np
from pandas import Series , DataFrame
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import classification_report
from sklearn.metrics import r2_score
from sklearn.decomposition import TruncatedSVD


## **Read the Data into DataFrame**

In [ ]:
placement = pd.read_csv("Placement_Data_Full_Class.csv")

In [ ]:
placement.head()

   sl_no gender  ssc_p    ssc_b  ...  specialisation  mba_p      status    salary
0      1      M  67.00   Others  ...          Mkt&HR  58.80      Placed  270000.0
1      2      M  79.33  Central  ...         Mkt&Fin  66.28      Placed  200000.0
2      3      M  65.00  Central  ...         Mkt&Fin  57.80      Placed  250000.0
3      4      M  56.00  Central  ...          Mkt&HR  59.43  Not Placed       NaN
4      5      M  85.80  Central  ...         Mkt&Fin  55.50      Placed  425000.0

[5 rows x 15 columns]

In [ ]:
placement.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sl_no           215 non-null    int64
 1   gender          215 non-null    object
 2   ssc_p           215 non-null    float64
 3   ssc_b           215 non-null    object
 4   hsc_p           215 non-null    float64
 5   hsc_b           215 non-null    object
 6   hsc_s           215 non-null    object
 7   degree_p        215 non-null    float64
 8   degree_t        215 non-null    object
 9   workex          215 non-null    object
 10  etest_p         215 non-null    float64
 11  specialisation  215 non-null    object
 12  mba_p           215 non-null    float64
 13  status          215 non-null    object
 14  salary          148 non-null    float64
dtypes: float64(6), int64(1), object(8)
memory usage: 25.3+ KB

In [ ]:
placement.shape

(215, 15)

In [ ]:
placement.specialisation

0       Mkt&HR
1      Mkt&Fin
2      Mkt&Fin
3       Mkt&HR
4      Mkt&Fin
        ...
210    Mkt&Fin
211    Mkt&Fin
212    Mkt&Fin
213     Mkt&HR
214     Mkt&HR
Name: specialisation, Length: 215, dtype: object

## **Replace the Data and Missing Values**

In [ ]:
placement.replace({'workex':{'Yes':1,'?':1,'No':0}},inplace=True)
placement.replace({'status':{'Placed':1,'?':1,'Not Placed':0}},inplace=True)
placement.replace({'gender':{'M':1,'?':1,'F':0}},inplace=True)
placement.replace({'degree_t':{'Sci&Tech':1 ,'Others':2,'Comm&Mgmt':0}},inplace=True)
placement.replace({'specialisation':{'Mkt&HR':1 ,'Mkt&Fin':0}},inplace=True)
placement.replace({'ssc_b':{'Others':1 ,'?':1,'Central':0}},inplace=True)
placement.replace({'hsc_b':{'Others':1 ,'?':1,'Central':0}},inplace=True)
placement.replace({'hsc_s':{'Commerce':1 ,'Science':2,'Arts':0}},inplace=True)
placement.head()

   sl_no  gender  ssc_p  ssc_b  ...  specialisation  mba_p  status    salary
0      1       1  67.00      1  ...               1  58.80       1  270000.0
1      2       1  79.33      0  ...               0  66.28       1  200000.0
2      3       1  65.00      0  ...               0  57.80       1  250000.0
3      4       1  56.00      0  ...               1  59.43       0       NaN
4      5       1  85.80      0  ...               0  55.50       1  425000.0

[5 rows x 15 columns]

In [ ]:
placement.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sl_no           215 non-null    int64
 1   gender          215 non-null    int64
 2   ssc_p           215 non-null    float64
 3   ssc_b           215 non-null    int64
 4   hsc_p           215 non-null    float64
 5   hsc_b           215 non-null    int64
 6   hsc_s           215 non-null    int64
 7   degree_p        215 non-null    float64
 8   degree_t        215 non-null    int64
 9   workex          215 non-null    int64
 10  etest_p         215 non-null    float64
 11  specialisation  215 non-null    int64
 12  mba_p           215 non-null    float64
 13  status          215 non-null    int64
 14  salary          148 non-null    float64
dtypes: float64(6), int64(9)
memory usage: 25.3 KB

In [ ]:
check_for_nan = placement['salary'].isnull().values.any()
print (check_for_nan)

True

In [ ]:
count_nan = placement['salary'].isnull().sum()
print ('Count of NaN: ' + str(count_nan))

Count of NaN: 67

In [ ]:
placement['salary'].fillna(0, inplace = True) 
placement.head()

   sl_no  gender  ssc_p  ssc_b  ...  specialisation  mba_p  status    salary
0      1       1  67.00      1  ...               1  58.80       1  270000.0
1      2       1  79.33      0  ...               0  66.28       1  200000.0
2      3       1  65.00      0  ...               0  57.80       1  250000.0
3      4       1  56.00      0  ...               1  59.43       0       0.0
4      5       1  85.80      0  ...               0  55.50       1  425000.0

[5 rows x 15 columns]

In [ ]:
placement.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sl_no           215 non-null    int64
 1   gender          215 non-null    int64
 2   ssc_p           215 non-null    float64
 3   ssc_b           215 non-null    int64
 4   hsc_p           215 non-null    float64
 5   hsc_b           215 non-null    int64
 6   hsc_s           215 non-null    int64
 7   degree_p        215 non-null    float64
 8   degree_t        215 non-null    int64
 9   workex          215 non-null    int64
 10  etest_p         215 non-null    float64
 11  specialisation  215 non-null    int64
 12  mba_p           215 non-null    float64
 13  status          215 non-null    int64
 14  salary          215 non-null    float64
dtypes: float64(6), int64(9)
memory usage: 25.3 KB


##**Create Test and Train and slice the data**

In [ ]:
y= placement ['salary']

In [ ]:
x= placement[[i for i in placement.columns if i != 'salary']]

In [ ]:
train_x,val_x,train_y,val_y = train_test_split(x,y)

In [ ]:
train_x.shape, val_y.shape

((161, 14), (54,))

In [ ]:
train_x.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 161 entries, 55 to 82
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sl_no           161 non-null    int64
 1   gender          161 non-null    int64
 2   ssc_p           161 non-null    float64
 3   ssc_b           161 non-null    int64
 4   hsc_p           161 non-null    float64
 5   hsc_b           161 non-null    int64
 6   hsc_s           161 non-null    int64
 7   degree_p        161 non-null    float64
 8   degree_t        161 non-null    int64
 9   workex          161 non-null    int64
 10  etest_p         161 non-null    float64
 11  specialisation  161 non-null    int64
 12  mba_p           161 non-null    float64
 13  status          161 non-null    int64
dtypes: float64(5), int64(9)
memory usage: 18.9 KB

In [ ]:
train_y.describe()

count       161.000000
mean     190018.633540
std      148485.709415
min           0.000000
25%           0.000000
50%      240000.000000
75%      276000.000000
max      690000.000000
Name: salary, dtype: float64


##**Apply Logistic Regression to the dataset**

In [ ]:
logreg = LogisticRegression(max_iter=1000)

In [ ]:
Scaler= StandardScaler()
Scale_train_x = Scaler.fit_transform(train_x)
Scale_val_x = Scaler.fit_transform(val_x)

In [ ]:
y_pred = model.predict(Scale_val_x)
print(classification_report(val_y,y_pred))

              precision    recall  f1-score   support

         0.0       1.00      1.00      1.00        14
    200000.0       0.00      0.00      0.00         3
    210000.0       0.00      0.00      0.00         2
    216000.0       0.00      0.00      0.00         1
    220000.0       0.00      0.00      0.00         0
    231000.0       0.00      0.00      0.00         1
    240000.0       0.00      0.00      0.00         1
    250000.0       0.00      0.00      0.00         5
    260000.0       0.00      0.00      0.00         3
    265000.0       0.25      0.50      0.33         2
    270000.0       0.00      0.00      0.00         3
    275000.0       0.00      0.00      0.00         1
    276000.0       0.00      0.00      0.00         1
    280000.0       0.00      0.00      0.00         2
    290000.0       0.00      0.00      0.00         1
    300000.0       0.20      0.40      0.27         5
    340000.0       0.00      0.00      0.00         1
    360000.0       0.00      0.00      0.00         2
    380000.0       0.00      0.00      0.00         1
    400000.0       0.00      0.00      0.00         1
    420000.0       0.00      0.00      0.00         1
    425000.0       0.00      0.00      0.00         0
    450000.0       0.00      0.00      0.00         1
    500000.0       0.00      0.00      0.00         1
    940000.0       0.00      0.00      0.00         1

    accuracy                           0.31        54
   macro avg       0.06      0.08      0.06        54
weighted avg       0.29      0.31      0.30        54

/usr/local/lib/python3.6/dist-packages/sklearn/metrics/_classification.py:1272: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
/usr/local/lib/python3.6/dist-packages/sklearn/metrics/_classification.py:1272: UndefinedMetricWarning: Recall and F-score are ill-defined and being set to 0.0 in labels with no true samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))

In [ ]:
r2_score(val_y,y_pred)

0.5135487465037365

Predict Salary of a new student to be placed

In [ ]:
model = logreg.fit(Scale_train_x,train_y)

In [ ]:
model.predict([Scale_train_x[1]])

array([240000.])

In [ ]:
train_y.head()

55    220000.0
62    240000.0
92    230000.0
11    250000.0
2     250000.0
Name: salary, dtype: float64

In [168]:
new_student = [1, 0, 1, 0,	1,	0,	0,	1,	0,	0,	1,	0, 1, 0]

In [171]:
model.predict([new_student])

array([300000.])